INSERT INTO personal_info (firstname, lastname, patronymic, phone_number, image, sex, birthdate, passport_number,
                           id_passport_number, passport_issued_by, registration, status, pets, bike,
                           stroller) VALUES
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','MALE','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'собака', '1', '2'),
('Сергеева', 'Анна', 'Петровна', '375296663466','sdaa','FEMALE','1990-12-20','MP234232','2112235923802193',
 'Первомайским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','MARRIED', 'кот', '0', '0'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','MALE','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','MALE','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','MALE','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','MALE','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','MALE','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'собака', '1', '2');

INSERT INTO dormitory(name, address, square, square_live, start_year, amount_rooms) VALUES
('Общежитие №1', 'Ботаническая 17', '88', '80', '1990-01-01','80'),
('Общежитие №2', 'Ботаническая 4', '77', '66', '1990-01-01','50');

INSERT INTO manager(name, type_document, number, date) VALUES
('Сак Денис Александрович', 'доверенность', '204-Б', '2022-03-03');

INSERT INTO work(name, address) VALUES
('филиал "Трамвайный парк"', 'ул. Ботаническая 4'),
('УП "МИНГАЗ"', 'Ботаническая 12'),
('филиал "Транспортный парк 1"', 'Какая-то улица'),
('БЧ', 'Какая-то улица'),
('Microsoft', 'Какая-то улица'),
('GOOGLE', 'Какая-то улица'),
('филиал Ада', 'Какая-то улица');

INSERT INTO users(login, password, role) VALUES
('ADMIN', '123','ADMIN');

INSERT INTO room(number, type, square, square_live, floor, image, amount, dormitory_id) VALUES
('12','ASD',32.1,20.8,1,'adsasd',2,1),
('28A','BLOCKED',60.1,53.8,2,'adsasd',2,2),
('53','ASD',17.1,12.8,5,'adsasd',1,1),
('41','ASD',17,13,4,'adsasd',2,1),
('28B','BLOCKED',60.1,53.8,2,'adsasd',2,2),
('33','ASD',25.1,13,3,'adsasd',3,2),
('28','ASD',16.1,12.8,2,'adsasd',2,2),
('1','ASD',15.1,10.8,1,'adsasd',2,1),
('54','ASD',32.1,25.8,5,'adsasd',3,1),
('11','ASD',21.1,18.8,1,'adsasd',2,2),
('17','ASD',35.1,30.8,1,'adsasd',3,1),
('26','ASD',19.1,15,2,'adsasd',2,1),
('13','ASD',14.1,9,1,'adsasd',1,1);

INSERT INTO tenant(personal_info_id, room_id, workplace_id, job_title, notes, is_tenant, date_registration, date_registration_end, date_revise, status_employee) VALUES
(1,1,1,'Инженер','','true','2022-01-15', '2023-01-15', '2022-03-15','STANDARD'),
(2,2,2,'Инженер','','true','2022-01-15', '2023-01-15', '2022-03-15','OTHER'),
(3,3,3,'Инженер','курил в туалете','true','2022-01-15', '2023-01-15', '2022-03-15','STANDARD'),
(4,4,4,'Инженер','','true','2022-01-15', '2023-01-15', '2022-03-15','STANDARD'),
(5,5,5,'Инженер','','true','2022-01-15', '2023-01-15', '2022-03-15','OTHER'),
(6,6,6,'Инженер','','true','2022-01-15', '2023-01-15', '2022-03-15','OTHER'),
(7,7,7,'Инженер','','true','2022-01-15', '2023-01-15', '2022-03-15','STANDARD');

INSERT INTO relation(current_tenant_id, family_tenant_id, family_status) VALUES
(1,2,'WIFE'),
(1,3,'SON'),
(1,4,'DAUGHTER'),
(5,2,'HUSBAND');

INSERT INTO contract(contract_number, contract_start, type, contract_end, contract_registration, number_registration, contract_petition, tenant_id) VALUES
('141/2','2022-04-15','STANDARD','2023-04-14','2022-04-18', '15', null, 1),
('141/2','2022-04-15','OTHER','2023-04-14','2022-04-18', '15', '2022-03-20', 1),
('141/2','2022-04-15','STANDARD','2023-04-14','2022-04-18', '15', null, 1),
('141/2','2022-04-15','STANDARD','2023-04-14','2022-04-18', '15', null, 1),
('141/2','2022-04-15','OTHER','2023-04-14','2022-04-18', '15', '2022-03-20', 1),
('141/2','2022-04-15','OTHER','2023-04-14','2022-04-18', '15', '2022-03-20', 1),
('141/2','2022-04-15','STANDARD','2023-04-14','2022-04-18', '15', null, 1),
('141/2','2022-04-15','OTHER','2023-04-14','2022-04-18', '15', '2022-03-20', 1),
('141/2','2022-04-15','STANDARD','2023-04-14','2022-04-18', '15', null, 1);


