INSERT INTO personal_info (firstname, lastname, patronymic, phone_number, image, sex, birthdate, passport_number,
                           id_passport_number, passport_issued_by, registration, status, partner, children, pets, bike,
                           stroller) VALUES
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','Male','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'Иванова Елена Сергеевна',
 'Иванов Анатолий Иванович, Иванова Елизавета Андреевна', 'собака', '1', '2'),
('Сергеева', 'Анна', 'Петровна', '375296663466','sdaa','FEMALE','1990-12-20','MP234232','2112235923802193',
 'Первомайским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','MARRIED', 'Сергеев Петр Инокентьевич',
 'Сергеев Анатолий Иванович, Сергеева Елизавета Андреевна', 'кот', '0', '0'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','Male','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'Иванова Елена Сергеевна',
 'Иванов Анатолий Иванович, Иванова Елизавета Андреевна', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','Male','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'Иванова Елена Сергеевна',
 'Иванов Анатолий Иванович, Иванова Елизавета Андреевна', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','Male','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'Иванова Елена Сергеевна',
 'Иванов Анатолий Иванович, Иванова Елизавета Андреевна', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','Male','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'Иванова Елена Сергеевна',
 'Иванов Анатолий Иванович, Иванова Елизавета Андреевна', 'собака', '1', '2'),
('Иван', 'Иванов', 'Иванович', '375296666666','sdaa','Male','2000-12-20','MP231232','2132131923802193',
 'Советским РУВД г.Минска', 'Минск, ул. Кедышко д.28, к.5б','DIVORCED', 'Иванова Елена Сергеевна',
 'Иванов Анатолий Иванович, Иванова Елизавета Андреевна', 'собака', '1', '2');

INSERT INTO dormitory(name, address, square, square_live, start_year, amount_rooms) VALUES
('Общежитие №1', 'Ботаническая 17', '88', '80', '1990-01-01','80'),
('Общежитие №2', 'Ботаническая 4', '77', '66', '1990-01-01','50');